In [1]:
data = {
  'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'], 
  'Age': [25, 30, 35, 40, 45], 
  'Department': ['HR', 'IT', 'Finance', 'Marketing', 'Operations']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(data)

In [5]:
df

      Name  Age  Department
0    Alice   25          HR
1      Bob   30          IT
2  Charlie   35     Finance
3    David   40   Marketing
4      Eve   45  Operations

### Retrieve the row of the DataFrame where the Name is 'Charlie'.

In [16]:
charlie_data = df[df['Name'] == 'Charlie']

In [17]:
charlie_data

      Name  Age Department
2  Charlie   35    Finance

### Select all the rows where the Age is greater than 30 using loc

In [18]:
age_30 = df[df['Age'] > 30]

In [19]:
age_30

      Name  Age  Department
2  Charlie   35     Finance
3    David   40   Marketing
4      Eve   45  Operations

### Extract the third row of the DataFrame using iloc.

In [20]:
df.iloc[2]

Name          Charlie
Age                35
Department    Finance
Name: 2, dtype: object

### Using iloc, select the first three rows and only the Name and Age columns.

In [34]:
df.iloc[0:3,[0,2]]

      Name Department
0    Alice         HR
1      Bob         IT
2  Charlie    Finance

In [37]:
df.loc[:2,['Name','Age']]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

### Change the Age of 'David' to 42 using loc.

In [43]:
david_new_age = df.loc[df['Name'] == 'David','Age'] = 42

In [44]:
david_new_age

42

In [39]:
#df.loc[3,'Age'] = 4   -> changing age also work

In [45]:
df

      Name  Age  Department
0    Alice   25          HR
1      Bob   30          IT
2  Charlie   35     Finance
3    David   42   Marketing
4      Eve   45  Operations

### Update the Department of all employees who are in the 'IT' department to 'Tech Support'.

In [59]:
df.loc[df['Department'] == 'IT','Department'] == 'Tech Support'

Series([], Name: Department, dtype: bool)

In [60]:
df

      Name  Age    Department
0    Alice   25            HR
1      Bob   30  Tech Support
2  Charlie   35       Finance
3    David   42     Marketing
4      Eve   45    Operations

### Use iloc to update the Age of the second row to 32.

In [62]:
df.iloc[1,1] = 32

In [63]:
df

      Name  Age    Department
0    Alice   25            HR
1      Bob   32  Tech Support
2  Charlie   35       Finance
3    David   42     Marketing
4      Eve   45    Operations

### Change the value of the Department in the first row to 'Admin' using iloc.

In [65]:
df.iloc[0,2] = 'Admin'

In [66]:
df

      Name  Age    Department
0    Alice   25         Admin
1      Bob   32  Tech Support
2  Charlie   35       Finance
3    David   42     Marketing
4      Eve   45    Operations